app/controllers/applications_controller.rb

  def index
    # @applications = Application.where(["name LIKE ?","%#{params[:search]}%"])
    @applications = Application.search(params[:search])
---
SELECT "applications".* FROM "applications" WHERE (name LIKE '%%' and price >= '' and price <= '') AND (name LIKE '%%')

  def create
    @application = Application.new(application_params)

    respond_to do |format|
      if @application.save
---
INSERT INTO "applications" ("name", "description", "price", "link", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "platform", "version", "developer") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @application.update(application_params)
---
UPDATE "applications" SET "platform" = ?, "version" = ?, "developer" = ?, "updated_at" = ? WHERE "applications"."id" = ?  [["platform", "Android"], ["version", "1.0.0"], ["developer", "The Weather Channel"], ["updated_at", "2017-12-03 20:52:11.631784"], ["id", 4]]

  def destroy
    @application.destroy
---
DELETE FROM "applications" WHERE "applications"."id" = ?  [["id", 2]]

    def set_application
      @application = Application.find(params[:id])
---
SELECT  "applications".* FROM "applications" WHERE "applications"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]